/*
 ============================================================================
 Name        : proctxt.c
 Author      : liuyou
 Version     :
 Copyright   : copyleft 2013 10
 Description : Hello World in C, Ansi-style
 ============================================================================
 "0",,,"1900467630936",,,,,,,,,,,,,,,,,,,,,,,,,,
 "1",,"679100",,,,,,,,"李竹",,,,"1000","0","10","2013-09-20 23:56:51",
 "53201239846057","14782828649","op03pai","1.0","2013-09-21 00:00:00",
 "21",,,,,,,,,,,,,,,,,,,,

 日期 时间 时间戳 整数 浮点数
自定义类型：机构编码6位数字 运单编码13位数字
取值区间有枚举、范围


 */

#include <stdio.h>
#include <stdlib.h>

int main(void) {
	puts("!!!Hello World!!!"); /* prints !!!Hello World!!! */
	return EXIT_SUCCESS;
}
